perf/test_ping.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Rampa tranquila
      duration: 10
      arrivalRate: 5
      rampTo: 15
    - name: Plain - cantidad fija requests
      duration: 30
      arrivalRate: 15
    - name: Ramp - más violenta
      duration: 30
      arrivalRate: 15
      rampTo: 1600
    - name: Plain - más violenta
      duration: 30
      arrivalRate: 1600

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping'