perf/test_ping2.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Rampa tranquila
      duration: 10
      arrivalRate: 1000 # cant. peticiones/seg
      rampTo: 10 # ???
    - name: Plain - cantidad fija requests
      duration: 10
      arrivalRate: 1000
    - name: Ramp - media
      duration: 10
      arrivalRate: 2000
      rampTo: 20

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping'